/* Динамическая типизация - это возможност одного типа данных превращаться в другой тип данных
  число --> строкой  \  строка --> числом \  объект --> булиновым значением и т.д.
*/
//========================================================================================================================================================

//! To String - в строку

//*  1) - редко пользуются

console.log(typeof String(null));
console.log(typeof String(45));

// * 2) - конкатинация - всегда правращает в строку! При сложении со строкой всегда получается строка.
console.log(typeof (45 + ""));
const num = 5;
console.log("http://df.ua/catalog/" + num); // получаем полный адресс http://df.us/catalog/5
const fontSize = 26 + "px"; // получаем 26px

//========================================================================================================================================================

//! To Number - в число
//*  1) - редко пользуются
console.log(typeof Number("5")); // получем цифру из строки

//*  2) - унарный плюс '+' - ставят ПЕРЕД типом данных
console.log(typeof +"5");

//*  3) - Метод - parseInt - 1 - аргумент строка 2 - система
console.log(typeof parseInt("15px", 10));

//========================================================================================================================================================

//! To boolen - в true или false
// ВСЕГДА - false -- 0, '', null, undefined, NaN
// Все остальное всегда - true

// 1) - Нативное преобразование
let switcher = null;
if (switcher) {
	console.log("Working....");
}
switcher = 3;
if (switcher) {
	console.log("Working....");
}

// 2) - Boolean - редко
console.log(typeof Boolean(45));

// 3) - два знака !! - в булевое значение
console.log(typeof !!"45");
